# Pandas 소개

## 모듈 로딩

In [294]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
%matplotlib inline

## 시리즈 클래스 : Series
- Series = value + index
- numpy의 1차원 배열의 의미를 가진다.

### 시리즈생성

In [2]:
# 2015년도 각 도시의 인구 데이터를 시리즈 객체로 생성
s = pd.Series([9904312, 3448737, 2466052,2890451], index =['서울','부산','인천','대구'])

In [4]:
s

서울    9904312
부산    3448737
인천    2466052
대구    2890451
dtype: int64

In [5]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
s.values

array([9904312, 3448737, 2466052, 2890451], dtype=int64)

In [7]:
s.name = '인구'
s.index.name = '도시'

In [8]:
s

도시
서울    9904312
부산    3448737
인천    2466052
대구    2890451
Name: 인구, dtype: int64

### 시리즈 연산
- 넘파이처럼 벡터화 연산을 수행한다.

In [9]:
s/100000

도시
서울    99.04312
부산    34.48737
인천    24.66052
대구    28.90451
Name: 인구, dtype: float64

### 시리즈 인덱싱
- 넘파이 배열의 인덱싱과 슬라이싱과 동일하다

In [10]:
s[3],s['대구']

(2890451, 2890451)

In [12]:
s[s>=3000000]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

### 시리즈 슬라이싱

In [13]:
s['부산':'대구']

도시
부산    3448737
인천    2466052
대구    2890451
Name: 인구, dtype: int64

In [14]:
s[1:3]

도시
부산    3448737
인천    2466052
Name: 인구, dtype: int64

**라벨값이 영문 문자열일 경우 인덱스의 라벨의 속성인것처럼 점(.)을 이용하여 인덱스값에 접근 가능**

In [15]:
s0 = pd.Series(np.arange(3), index=['a','b','c'])

In [16]:
s0

a    0
b    1
c    2
dtype: int32

In [17]:
s0.a

0

In [18]:
s0.c, s0['c']

(2, 2)

**시리즈와 딕셔너리 자료형**
- 파이썬의 dictionary 자료형을 바로 판다스의 Series 객체로 변환 가능
- 딕셔너리의 키는 시리즈의 index가 된다.
- 딕셔너리의 주요함수 : get('키') == 사전['키'], 사전.keys() => 시리즈객체명.index
- 사전명.values() => 시리즈객체명.values
- 사전명.items() : key와 value를 쌍으로 얻어오는 함수
- in 연산자와 not in 연산자

In [19]:
'대전' in s

False

In [20]:
s2 = pd.Series({'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158})

In [21]:
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [22]:
ds = s -s2

In [23]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천   -165983.0
dtype: float64

- 대구와 대전의 경우 두 시리즈에 공통의 인덱스로 존재하지 않기 때문에 연산을 수행할 수 없어 그 결과값으로 NaN값을 가진다.
- NaN값이 float 자료형에서만 적용되므로 연산의 결과가 모두 float형으로 바뀌었다.

In [24]:
# NaN이 아닌 값을 구하려면 notnull메서드를 사용한다.
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [25]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천   -165983.0
dtype: float64

In [26]:
res = (s-s2)/s2*100
res = res[res.notnull()]

In [27]:
res

부산    1.636984
서울    2.832690
인천   -6.306261
dtype: float64

### 데이터의 갱신, 추가, 삭제
- 인덱싱을 이용하면 딕셔너리처럼 데이터를 갱신(update)하거나 추가(add)할 수 있다.

In [28]:
res['부산'] = 1.63

In [29]:
res

부산    1.630000
서울    2.832690
인천   -6.306261
dtype: float64

In [30]:
del res['서울']
res

부산    1.630000
인천   -6.306261
dtype: float64

## 데이터프레임 클래스
- 시리즈는 1차원 배열과 같다.
- 데이터프레임은 2차원 배열(행렬,matrix)과 비슷하다.
- 행렬은 행인덱스와 열인덱스가 존재한다.

In [38]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]}
columns = ['지역','2015','2010','2005','2000','2010-2015 증가율']
index = ['서울','부산','인천','대구']

df = pd.DataFrame(data, index=index, columns=columns)

### 데이터프레임 생성
- 여러개의 시리즈객체가 묶여서 생성된다.
- 딕셔너리를 이용(키가 열인덱스)
- 속성 : data, index, dtype, columns

In [40]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [41]:
# 데이터 값에만 접근 values 속성
# 열인덱스와 행인덱스는 각각 columns, index 속성
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [42]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [43]:
df.index.name = '도시'
df.columns.name = '특성'

In [44]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [45]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

### 열 데이터의 갱신, 추가, 삭제
- 열하나가 시리즈객체와 같다.

In [46]:
df['2010-2015 증가율']= df['2010-2015 증가율']*100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [49]:
df['2005-2010 증가율'] = (((df['2010']-df['2005'])/df['2005'])*100).round(2)

In [50]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [51]:
del df['2010-2015 증가율']

In [52]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

### 열 인덱싱
- 딕셔너리와 비슷
- 열이름이 딕셔너리의 키와 같다

In [53]:
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [54]:
# 여러개의 열인덱스로 추출하면 데이터프레임으로 반환된다.
df[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [56]:
df[['지역']]

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [58]:
tbl = pd.DataFrame({'weight':[80,70.4,65.5,45.9,51.2],
                   'height' : [170, 180, 155, 143, 154],
                   'gender' : ['f','m','m','f','f']
                   })

In [59]:
tbl

   weight  height gender
0    80.0     170      f
1    70.4     180      m
2    65.5     155      m
3    45.9     143      f
4    51.2     154      f

In [60]:
type(tbl)

pandas.core.frame.DataFrame

In [61]:
type(tbl['weight'])

pandas.core.series.Series

In [62]:
tbl[['height','weight']]

   height  weight
0     170    80.0
1     180    70.4
2     155    65.5
3     143    45.9
4     154    51.2

In [63]:
tbl

   weight  height gender
0    80.0     170      f
1    70.4     180      m
2    65.5     155      m
3    45.9     143      f
4    51.2     154      f

In [64]:
tbl[tbl['height']>=160]

   weight  height gender
0    80.0     170      f
1    70.4     180      m

In [65]:
tbl[tbl.height>=160]

   weight  height gender
0    80.0     170      f
1    70.4     180      m

In [66]:
# 오름차순 정렬, ascending=False,내림차순
tbl.sort_values('height')

   weight  height gender
3    45.9     143      f
4    51.2     154      f
2    65.5     155      m
0    80.0     170      f
1    70.4     180      m

In [67]:
tbl.sort_values('height',ascending=False)

   weight  height gender
1    70.4     180      m
0    80.0     170      f
2    65.5     155      m
4    51.2     154      f
3    45.9     143      f

In [68]:
tbl.keys

<bound method NDFrame.keys of    weight  height gender
0    80.0     170      f
1    70.4     180      m
2    65.5     155      m
3    45.9     143      f
4    51.2     154      f>

In [69]:
tbl.values

array([[80.0, 170, 'f'],
       [70.4, 180, 'm'],
       [65.5, 155, 'm'],
       [45.9, 143, 'f'],
       [51.2, 154, 'f']], dtype=object)

In [70]:
data={
    "names": ["김철수","이철호","김영희","박민수","송철호"],
    "year": [2014,2015,2016,2017,2018],
    "points": [1.5, 1.7, 3.6, 2.4, 2.9]
}
df2=pd.DataFrame(data,columns=['year','names','points','penalty'],index = ['one','two','three','four','five'])

In [71]:
df2

       year names  points penalty
one    2014   김철수     1.5     NaN
two    2015   이철호     1.7     NaN
three  2016   김영희     3.6     NaN
four   2017   박민수     2.4     NaN
five   2018   송철호     2.9     NaN

In [72]:
# 결측값 대체 함수 fillna(값)
df3 = df2.fillna(0)

In [73]:
df3

       year names  points  penalty
one    2014   김철수     1.5        0
two    2015   이철호     1.7        0
three  2016   김영희     3.6        0
four   2017   박민수     2.4        0
five   2018   송철호     2.9        0

In [74]:
df3.describe()
#count, mean, std, min, max, 사분위수

              year    points  penalty
count     5.000000  5.000000      5.0
mean   2016.000000  2.420000      0.0
std       1.581139  0.864292      0.0
min    2014.000000  1.500000      0.0
25%    2015.000000  1.700000      0.0
50%    2016.000000  2.400000      0.0
75%    2017.000000  2.900000      0.0
max    2018.000000  3.600000      0.0

In [75]:
# 데이터프레임에 대한 정보 추출
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   year     5 non-null      int64
 1   names    5 non-null      object
 2   points   5 non-null      float64
 3   penalty  5 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 200.0+ bytes

In [76]:
df3['penalty'] = [0.1, 0.2,0.3,0.4,0.5]

In [77]:
df3

       year names  points  penalty
one    2014   김철수     1.5      0.1
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4
five   2018   송철호     2.9      0.5

In [78]:
df3['ages'] = np.arange(10,15)

In [79]:
df3

       year names  points  penalty  ages
one    2014   김철수     1.5      0.1    10
two    2015   이철호     1.7      0.2    11
three  2016   김영희     3.6      0.3    12
four   2017   박민수     2.4      0.4    13
five   2018   송철호     2.9      0.5    14

In [81]:
del df3['ages']

In [82]:
df3

       year names  points  penalty
one    2014   김철수     1.5      0.1
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4
five   2018   송철호     2.9      0.5

In [83]:
df3[0:3]

       year names  points  penalty
one    2014   김철수     1.5      0.1
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3

In [84]:
df3['one':'four']

       year names  points  penalty
one    2014   김철수     1.5      0.1
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4

In [85]:
df3.loc['two']

year       2015
names       이철호
points      1.7
penalty     0.2
Name: two, dtype: object

In [86]:
df3['two':'four']

       year names  points  penalty
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4

In [87]:
df3.loc['two':'four','points']

two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [88]:
# 전체에서 특정필드(year, names)추출
df3[['year','names']]

       year names
one    2014   김철수
two    2015   이철호
three  2016   김영희
four   2017   박민수
five   2018   송철호

In [89]:
df3.loc[:,['year','names']]

       year names
one    2014   김철수
two    2015   이철호
three  2016   김영희
four   2017   박민수
five   2018   송철호

In [92]:
df3.iloc[3]

year       2017
names       박민수
points      2.4
penalty     0.4
Name: four, dtype: object

In [94]:
df3.iloc[3:5,0:2]

      year names
four  2017   박민수
five  2018   송철호

In [95]:
df3.iloc[1,1]

'이철호'

In [96]:
df3

       year names  points  penalty
one    2014   김철수     1.5      0.1
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4
five   2018   송철호     2.9      0.5

In [98]:
df3[df3['year']>2014]

       year names  points  penalty
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4
five   2018   송철호     2.9      0.5

In [99]:
df3.loc[df3['year']>2014,:]

       year names  points  penalty
two    2015   이철호     1.7      0.2
three  2016   김영희     3.6      0.3
four   2017   박민수     2.4      0.4
five   2018   송철호     2.9      0.5

### 데이터프레임 조작

In [109]:
df= pd.DataFrame(np.random.randn(6,4))

In [101]:
df

          0         1         2         3
0  0.184515  0.620071  0.480694 -2.662528
1  0.577529  0.618418  0.024652 -0.414751
2 -1.787290 -1.167916 -1.805278  1.316653
3 -0.140944 -1.003480 -0.928102 -2.317187
4 -0.261463  1.734018 -0.550984 -0.909826
5  1.534508 -0.813837  0.938058  0.330293

In [110]:
df.index=pd.date_range('20230926', periods=6)

In [111]:
df.columns=['A','B','C','D']

In [105]:
# 삭제 : del, drop
df.drop('D', axis=1)

                   A         B         C
2023-09-26  0.184515  0.620071  0.480694
2023-09-27  0.577529  0.618418  0.024652
2023-09-28 -1.787290 -1.167916 -1.805278
2023-09-29 -0.140944 -1.003480 -0.928102
2023-09-30 -0.261463  1.734018 -0.550984
2023-10-01  1.534508 -0.813837  0.938058

In [106]:
df

                   A         B         C         D
2023-09-26  0.184515  0.620071  0.480694 -2.662528
2023-09-27  0.577529  0.618418  0.024652 -0.414751
2023-09-28 -1.787290 -1.167916 -1.805278  1.316653
2023-09-29 -0.140944 -1.003480 -0.928102 -2.317187
2023-09-30 -0.261463  1.734018 -0.550984 -0.909826
2023-10-01  1.534508 -0.813837  0.938058  0.330293

In [107]:
del df['D']

In [108]:
df

                   A         B         C
2023-09-26  0.184515  0.620071  0.480694
2023-09-27  0.577529  0.618418  0.024652
2023-09-28 -1.787290 -1.167916 -1.805278
2023-09-29 -0.140944 -1.003480 -0.928102
2023-09-30 -0.261463  1.734018 -0.550984
2023-10-01  1.534508 -0.813837  0.938058

In [112]:
raw=df

In [113]:
raw.drop(['B','D'], axis=1)

                   A         C
2023-09-26 -0.398170 -1.216509
2023-09-27 -0.286994 -0.817234
2023-09-28  0.506337  1.329981
2023-09-29  1.938068  2.244677
2023-09-30  1.545141  0.911874
2023-10-01 -0.654903  1.702190

In [114]:
raw

                   A         B         C         D
2023-09-26 -0.398170 -0.871223 -1.216509  0.276331
2023-09-27 -0.286994 -0.212422 -0.817234 -0.028688
2023-09-28  0.506337 -0.278465  1.329981  1.028484
2023-09-29  1.938068 -0.852139  2.244677  0.464754
2023-09-30  1.545141 -0.222546  0.911874  0.443617
2023-10-01 -0.654903 -1.120297  1.702190  2.163841

## 데이터 입출력
- 댜양한 파일 포멧을 지원한다.
- CSV(쉼표로 구분된), Excel, HTML, JSON, HDF5, SAS, STATA, SQL

In [116]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

### csv 파일 로딩
- pd.read_csv()

In [117]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [118]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample2.csv

In [120]:
pd.read_csv('sample2.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [121]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [124]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181  -1.538472  1.347553  0.43381
1.024209  0.087307  -1.281997  0.49265
0.417899  -2.002308  0.255245  -1.10515

Writing sample3.txt

In [126]:
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [127]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명 :
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [128]:
# skiprows
pd.read_csv('sample4.txt', skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [129]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
누락, 3.33, three

Writing sample5.csv

In [130]:
df = pd.read_csv('sample5.csv', na_values=['누락'])

In [131]:
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0  2.22     two
2  NaN  3.33   three

### csv파일로 저장

In [132]:
df.to_csv('sample6.csv')

### 인터넷 상에 저장된 csv 파일 로딩

In [133]:
titanic = pd.read_csv('https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv')

In [135]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [136]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [137]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [140]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [141]:
titanic.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 고급 인덱싱

- 데이터프레임에서 특정 데이터만 추출하는 기능을 인덱싱이라고 부른다.
- 정수인덱싱, 라벨인덱싱
- [행인덱스, 열인덱스]
- loc : 라벨인덱싱
- iloc : 정수인덱싱

In [146]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                 index = ['a','b','c'], columns=['A','B','C','D'])

In [147]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [148]:
# 하나의 행 인덱스를 사용하는 경우
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [152]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [153]:
#행인덱스에 슬라이싱할경우 loc 생략가능
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [154]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [155]:
df['A']

a    10
b    14
c    18
Name: A, dtype: int32

In [156]:
df.A

a    10
b    14
c    18
Name: A, dtype: int32

In [157]:
df[df['A']>15]

    A   B   C   D
c  18  19  20  21

In [158]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [159]:
df['A']

a    10
b    14
c    18
Name: A, dtype: int32

In [160]:
df[['A','B']]

    A   B
a  10  11
b  14  15
c  18  19

In [162]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [164]:
df.loc['a','A']

10

In [166]:
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [168]:
df.iloc[0,1]

11

### 주요함수

In [169]:
# 데이터프레임의 데이터 개수 : count
s = pd.Series(range(10))

In [171]:
s.count()

10

In [172]:
s[3]=np.nan

In [173]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [174]:
s.count()

9

In [179]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5,size=(4,4)),dtype=float)

In [181]:
df.iloc[2,3] = np.nan

In [182]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [183]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [184]:
import seaborn as sns

In [185]:
titanic = sns.load_dataset('titanic')

In [186]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [187]:
# 타이타닉호의 승객 데이터를 활용하여 데이터의 개수를 추출하되, 각열마다 추출하시오.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

**value_counts() 개별값의 건수를 추출하는 함수**

In [188]:
s2 = pd.Series(np.random.randint(6, size=100))

In [189]:
s2

0     3
1     3
2     2
3     1
4     2
     ..
95    3
96    0
97    0
98    2
99    5
Length: 100, dtype: int32

In [190]:
s2.value_counts()

2    22
0    18
3    17
1    15
5    15
4    13
dtype: int64

In [191]:
titanic['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [192]:
titanic['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

**정렬**
- sort_index : 인덱스값을 기준으로 정렬
- sort_values : 값을 기준으로 정렬

In [195]:
s2.value_counts().sort_index()

0    18
1    15
2    22
3    17
4    13
5    15
dtype: int64

In [196]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [197]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [198]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [202]:
df.sort_values(by=[1,2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [220]:
# sort_values 메서드를 사용하여 타이타닉호 승객에 대한 성별 인원수, 나이별 인원수, 선실별 인원수, 생존/사망 인원수를 추출하시오.
titanic['sex'].value_counts()
titanic['age'].value_counts()
titanic['pclass'].value_counts().sort_index()
titanic['survived'].value_counts()

C:\Users\NT551_11TH\AppData\Local\Temp\ipykernel_11092\87187339.py:6: FutureWarning: In a future version of pandas all arguments of Series.sort_values will be keyword-only
  titanic.value_counts().sort_values('sex')

ValueError: No axis named sex for object type Series

### 행/열 합계 : sum(axis= 0(열), axis=1(행))

In [230]:
df3 = pd.DataFrame(np.random.randint(10, size=(4,8)))

In [222]:
df3

   0  1  2  3  4  5  6  7
0  4  2  9  7  1  9  2  1
1  0  7  1  8  9  0  7  0
2  5  2  5  1  3  3  1  8
3  6  8  1  5  7  0  9  1

In [223]:
df3.sum()

0    15
1    19
2    16
3    21
4    20
5    12
6    19
7    10
dtype: int64

In [224]:
df3.sum(axis=0)

0    15
1    19
2    16
3    21
4    20
5    12
6    19
7    10
dtype: int64

In [225]:
df3.sum(axis=1)

0    35
1    32
2    28
3    37
dtype: int64

In [231]:
df3['RowSum'] = df3.sum(axis=1)

In [232]:
df3

   0  1  2  3  4  5  6  7  RowSum
0  5  9  2  0  0  4  6  3      29
1  1  8  5  9  5  4  2  7      41
2  8  7  3  4  8  6  3  8      47
3  8  5  1  3  3  3  2  6      31

In [233]:
df3.loc['ColSum',:] = df3.sum()

In [234]:
df3

           0     1     2     3     4     5     6     7  RowSum
0        5.0   9.0   2.0   0.0   0.0   4.0   6.0   3.0    29.0
1        1.0   8.0   5.0   9.0   5.0   4.0   2.0   7.0    41.0
2        8.0   7.0   3.0   4.0   8.0   6.0   3.0   8.0    47.0
3        8.0   5.0   1.0   3.0   3.0   3.0   2.0   6.0    31.0
ColSum  22.0  29.0  11.0  16.0  16.0  17.0  13.0  24.0   148.0

1. 타이타닉호 승객의 평균나이는?
2. 타이타닉호 승객중 여성 승객의 평균나이는?
3. 타이타닉호 승객중 1등실에 있는 여성승객의 평균나이는?

In [238]:
titanic['age'].mean()

29.69911764705882

In [249]:
titanic[titanic['sex']=='female']['age'].mean()

27.915708812260537

In [253]:
titanic[(titanic['pclass']==1) & (titanic['sex']=='female')]['age'].mean()

34.61176470588235

### apply 변환
- 행 또는 열단위로 반복해서 특정 함수를 적용하는 기능
- apply(함수, axis)
- lambda 함수

In [254]:
data = pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})

In [255]:
data

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [256]:
# 각 열에 최대값과 최소값의 차이 추출
data['A'].max()-data['A'].min()

3

In [257]:
data.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [259]:
data.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

- adult/child를 판정하여 컬럼(adult/child)를 추가하시오
- 승객의 나이가 20살 이상이면 성인(adult) 그렇지 않으면 미성년(child)으로 표시할 것

In [260]:
titanic['adult/child']=titanic.apply(lambda x : 'adult' if x.age>= 20 else 'child',axis=1)

In [261]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [262]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [265]:
df.apply(pd.value_counts).fillna(0).astype(int)

     0  1  2  3
0.0  1  2  0  0
1.0  0  0  0  1
2.0  0  1  1  2
3.0  2  1  1  0
4.0  1  0  2  0

## 데이터 프레임의 인덱스 조작

### 데이터프레임의 인덱스 설정 및 제거
- set_index : 기존의 행 인덱스를 제거하고 데이터의 열중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가

In [267]:
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3,5),2)]).T, columns =['C1','C2','C3','C4'])

In [268]:
df1

  C1    C2    C3    C4
0  A   0.7  0.05   0.2
1  B  0.09  0.07  0.88
2  C  0.03  0.04  0.43
3  D  0.36   0.4  0.62
4  E  0.59  0.67  0.29

In [269]:
df2 = df1.set_index('C1')

In [270]:
df2

      C2    C3    C4
C1
A    0.7  0.05   0.2
B   0.09  0.07  0.88
C   0.03  0.04  0.43
D   0.36   0.4  0.62
E   0.59  0.67  0.29

In [272]:
df2.reset_index(drop=True)

     C2    C3    C4
0   0.7  0.05   0.2
1  0.09  0.07  0.88
2  0.03  0.04  0.43
3  0.36   0.4  0.62
4  0.59  0.67  0.29

### 데이터프레임 합성
- merge : 병합, 두 데이터프레임에 공통의 열 또는 행인덱스를 기준으로 데이터를 합친다.
- concat : 연결

In [273]:
df1 = pd.DataFrame({
    '고객번호':[1001,1002,1003,1004,1005,1006,1007],
    '이름':['둘리','도우너','또치','길동','희동','마이콜','영희']
})

In [274]:
df2 = pd.DataFrame({
    '고객번호':[1001,1001,1005,1006,1008,1001],
    '금액':[10000,20000,15000,5000,10000,3000]
})

In [275]:
df2

   고객번호     금액
0  1001  10000
1  1001  20000
2  1005  15000
3  1006   5000
4  1008  10000
5  1001   3000

In [276]:
# 두 데이터프레임에 공통의 키가 존재하는 데이터만 가능 : inner join
pd.merge(df1,df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리   3000
3  1005   희동  15000
4  1006  마이콜   5000

In [280]:
# outer join, 외부조인 : 키값이 한쪽만 있어도 병합 가능
# left outer join, right outer join
pd.merge(df1,df2, how='right')

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1005   희동  15000
3  1006  마이콜   5000
4  1008  NaN  10000
5  1001   둘리   3000

**join 메서드**

In [283]:
df3 = pd.DataFrame([[1,2],[3,4],[5,6]], index = ['a','c','e'], columns=['서울','부산'])
df3

   서울  부산
a   1   2
c   3   4
e   5   6

In [287]:
df4 = pd.DataFrame([[7,8],[9,10],[11,12],[13,14]], index=['b','c','d','e'], columns = ['대구','광주'])

In [288]:
pd.merge(df3,df4,how='outer', left_index=True, right_index=True)

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [289]:
df3.join(df4, how='outer')

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [290]:
s1 = pd.Series([0,1], index=['A','B'])
s2 = pd.Series([2,3,4], index=['A','B','C'])

In [291]:
pd.concat([s1,s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [292]:
df5 = pd.DataFrame(np.arange(6).reshape(3,2), index = ['a','b','c'], columns = ['데이터1','데이터2'])
df6 = pd.DataFrame(5+np.arange(4).reshape(2,2), index = ['a','c'], columns = ['데이터3','데이터4'])

In [293]:
pd.concat([df5,df6], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

## 그룹분석

- 특정 키를 조건으로 그룹을 설정하여 그룹에 특성을 이용하여 계산을 수행하는 기능
- groupby 메서드를 이용
**그룹연산 메서드**
- size, count : 그룹데이터의 개수
- mean, median, min, max
- sum, prod, std, var, quantile
- first, last

**그룹연산 메서드**
- agg, aggregate : 여러개 메서드 묶어서 쓰기위해 사용
- describe
- apply
- transform

In [295]:
df = pd.DataFrame({
    'key1':['A','A','B','B','A'],
    'key2':['one','two','one','two','one'],
    'data1':[1,2,3,4,5],
    'data2':[10,20,30,40,50]
})

In [296]:
df

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [297]:
# A그룹과 B그룹으로 구분
groups = df.groupby(df.key1)
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [299]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [300]:
df.groupby(df.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [301]:
df['data1'].groupby(df.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [302]:
df.groupby(df.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [303]:
df.groupby(df.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [304]:
df.data1.groupby([df.key1, df.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

# tips
- 식당에서 식사를 한 후 내는 팁과 관련된 데이터를 제공하는 데이터 셋
- seaborn 라이브러리에서 제공하는 데이터셋

In [305]:
import seaborn as sns
tips = sns.load_dataset('tips')
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

- total_bill : 총결제금액
- tip : 팁
- sex : 결제한사람성별
- smoker : 흡연여부
- day : 방문요일
- time : 방문한 시간대
- size : 인원수

In [307]:
# 결제금액대비 팁의 비율
tips['tip_pct'] =tips['tip']/tips['total_bill']
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [308]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   tip_pct     244 non-null    float64
dtypes: category(4), float64(3), int64(1)
memory usage: 9.3 KB

In [309]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [310]:
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [311]:
tips.groupby('sex').size()

sex
Male      157
Female     87
dtype: int64

In [312]:
# 성별에 따른 흡연여부
tips.groupby(['sex','smoker']).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [313]:
#성별에 따른 평균팁비율
tips.groupby(['sex'])['tip_pct'].mean()

sex
Male      0.157651
Female    0.166491
Name: tip_pct, dtype: float64

In [314]:
# 흡연여부에 따른 평균팁 비율
tips.groupby(['smoker'])['tip_pct'].mean()

smoker
Yes    0.163196
No     0.159328
Name: tip_pct, dtype: float64

In [317]:
tips['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [318]:
tips['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [321]:
tips.groupby('time')['tip'].mean()

time
Lunch     2.728088
Dinner    3.102670
Name: tip, dtype: float64

In [323]:
# 요일별 팁 비율
tips.groupby('day')['tip_pct'].describe().T

day         Thur        Fri        Sat        Sun
count  62.000000  19.000000  87.000000  76.000000
mean    0.161276   0.169913   0.153152   0.166897
std     0.038652   0.047665   0.051293   0.084739
min     0.072961   0.103555   0.035638   0.059447
25%     0.138210   0.133739   0.123863   0.119982
50%     0.153846   0.155625   0.151832   0.161103
75%     0.192687   0.196637   0.188271   0.187889
max     0.266312   0.263480   0.325733   0.710345

In [325]:
tips.groupby('time')['tip_pct'].describe().T

time       Lunch      Dinner
count  68.000000  176.000000
mean    0.164128    0.159518
std     0.040242    0.067477
min     0.072961    0.035638
25%     0.139147    0.123192
50%     0.154084    0.155400
75%     0.193917    0.188209
max     0.266312    0.710345

In [327]:
tips.groupby('size')['tip_pct'].describe().T

size          1           2          3          4         5         6
count  4.000000  156.000000  38.000000  37.000000  5.000000  4.000000
mean   0.217292    0.165719   0.152157   0.145949  0.141495  0.156229
std    0.080342    0.066848   0.045459   0.042395  0.067733  0.042153
min    0.137931    0.035638   0.056433   0.077459  0.065660  0.103799
25%    0.170779    0.135223   0.124758   0.117750  0.106572  0.131654
50%    0.202752    0.156104   0.159323   0.146699  0.121389  0.162891
75%    0.249265    0.195036   0.186135   0.169797  0.172194  0.187466
max    0.325733    0.710345   0.230742   0.280535  0.241663  0.195335

In [332]:
#요일별점심시간대에 평균팁비율
tips[tips['time'] == 'Lunch'].groupby('day')[['tip_pct']].describe().T

KeyError: False